---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SectionViewFailures.ScopeBoxBehindSection
source: html/202e7e9b-44f0-a9c5-e2ca-df57b4c682e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SectionViewFailures.ScopeBoxBehindSection Property

Section may not be associated to a scope box which lies behind it.

## Syntax (C#)
```csharp
public static FailureDefinitionId ScopeBoxBehindSection { get; }
```